wakwak-koba/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
      gpio_num_t scl_io = i2c_context[i2c_port].pin_scl;
      gpio_set_level(scl_io, 1);
      gpio_set_direction(scl_io, GPIO_MODE_OUTPUT_OD);

      auto mod = i2c_port == 0 ? PERIPH_I2C0_MODULE : PERIPH_I2C1_MODULE;
      periph_module_disable(mod);
      gpio_set_level(scl_io, 0);

      // SDAがHIGHになるまでクロック送出しながら待機する。
      int i = 0;
      while (!gpio_get_level(sda_io) && (i++ < I2C_CLR_BUS_SCL_NUM))
      {
        ets_delay_us(I2C_CLR_BUS_HALF_PERIOD_US);
        gpio_set_level(scl_io, 1);
        ets_delay_us(I2C_CLR_BUS_HALF_PERIOD_US);
        gpio_set_level(scl_io, 0);
      }
      gpio_set_level(sda_io, 0); // setup for STOP
      periph_module_enable(mod);
      gpio_set_level(scl_io, 1);
      periph_module_reset(mod);
      //gpio_set_level(sda_io, 1); // STOP, SDA low -> high while SCL is HIGH
      i2c_set_pin((i2c_port_t)i2c_port, sda_io, scl_io, gpio_pullup_t::GPIO_PULLUP_ENABLE, gpio_pullup_t::GPIO_PULLUP_ENABLE, I2C_MODE_MASTER);
    }

    static cpp::result<void, error_t> i2c_wait(int i2c_port, bool flg_stop = false)
    {
      if (i2c_context[i2c_port].state.has_error())
      {
        return cpp::fail(i2c_context[i2c_port].state.error());
      }
      cpp::result<void, error_t> res = {};
      auto dev = (i2c_port == 0) ? &I2C0 : &I2C1;
      typeof(dev->int_raw) int_raw;
//      static constexpr std::uint32_t intmask = I2C_ACK_ERR_INT_RAW_M | I2C_TIME_OUT_INT_RAW_M | I2C_END_DETECT_INT_RAW_M | I2C_ARBITRATION_LOST_INT_RAW_M;
      static constexpr std::uint32_t intmask = I2C_ACK_ERR_INT_RAW_M | I2C_END_DETECT_INT_RAW_M | I2C_ARBITRATION_LOST_INT_RAW_M;
      if (i2c_context[i2c_port].wait_ack)
      {
        i2c_context[i2c_port].wait_ack = false;
        int_raw.val = dev->int_raw.val;
        if (!(int_raw.val & intmask))
        {
          std::uint32_t us = lgfx::micros();
          std::uint32_t us_limit = (dev->scl_high_period.period + dev->scl_low_period.period + 16 ) * (16 + dev->status_reg.tx_fifo_cnt);
          do
          {
            int_raw.val = dev->int_raw.val;
          } while (!(int_raw.val & intmask) && ((lgfx::micros() - us) <= us_limit));
        }
        dev->int_clr.val = int_raw.val;

        if (!int_raw.end_detect || int_raw.ack_err)
        {
          res = cpp::fail(error_t::communication_error);
          i2c_context[i2c_port].state = cpp::fail(error_t::communication_error);
        }
      }
      else
      {
        if (flg_stop && i2c_context[i2c_port].state == i2c_context_t::state_read)
        {
          i2c_stop(i2c_port);
          i2c_context[i2c_port].state = i2c_context_t::state_t::state_disconnect;
        }
        return res;
      }
//*/
// if (!int_raw.end_detect || int_raw.ack_err)
// ESP_LOGI("LGFX", "I2C Error %08x", int_raw.val);
      if (flg_stop || !res)
      {
        if (int_raw.end_detect)
        {
          i2c_set_cmd(dev, 0, I2C_CMD_STOP, 0);
          dev->ctr.trans_start = 1;
          static constexpr std::uint32_t intmask = I2C_ACK_ERR_INT_RAW_M | I2C_TIME_OUT_INT_RAW_M | I2C_END_DETECT_INT_RAW_M | I2C_ARBITRATION_LOST_INT_RAW_M | I2C_TRANS_COMPLETE_INT_RAW_M;
          std::uint32_t ms = lgfx::millis();
          taskYIELD();
          while (!(dev->int_raw.val & intmask) && ((millis() - ms) < 14));          
          //ESP_LOGI("LGFX", "I2C stop");
        }
        else
        {
lgfx::pinMode(0, pin_mode_t::output);
lgfx::gpio_hi(0);
          dev->ctr.trans_start = 0;
          dev->fifo_conf.tx_fifo_rst = 1;
          dev->fifo_conf.tx_fifo_rst = 0;
          ESP_LOGI("LGFX", "I2C forced stop");
          i2c_stop(i2c_port);
lgfx::gpio_lo(0);
        }
        if (res)
        {
          i2c_context[i2c_port].state = i2c_context_t::state_t::state_disconnect;
        }
      }
      return res;
    }

    void init(int i2c_port, int pin_sda, int pin_scl)
    {
      if (i2c_port >= I2C_NUM_MAX) return;
      i2c_context[i2c_port].pin_scl = (gpio_num_t)pin_scl;
      i2c_context[i2c_port].pin_sda = (gpio_num_t)pin_sda;

      i2c_set_pin((i2c_port_t)i2c_port, pin_sda, pin_scl, gpio_pullup_t::GPIO_PULLUP_ENABLE, gpio_pullup_t::GPIO_PULLUP_ENABLE, I2C_MODE_MASTER);

      periph_module_enable(i2c_port == 0 ? PERIPH_I2C0_MODULE : PERIPH_I2C1_MODULE);
      periph_module_reset(i2c_port == 0 ? PERIPH_I2C0_MODULE : PERIPH_I2C1_MODULE);
    }

    void release(int i2c_port)
    {
      if (i2c_port >= I2C_NUM_MAX) return;
      periph_module_disable(i2c_port == 0 ? PERIPH_I2C0_MODULE : PERIPH_I2C1_MODULE);
      pinMode(i2c_context[i2c_port].pin_scl, pin_mode_t::input);
      pinMode(i2c_context[i2c_port].pin_sda, pin_mode_t::input);
    }

    void beginTransaction(int i2c_port, int i2c_addr, std::uint32_t freq, bool read)
    {
      if (i2c_port >= I2C_NUM_MAX) return;
      if (i2c_addr >= 1024) return;
//ESP_LOGI("LGFX", "i2c::beginTransaction : port:%d / addr:%02x / freq:%d / rw:%d", i2c_port, i2c_addr, freq, read);
      auto dev = (i2c_port == 0) ? &I2C0 : &I2C1;
      i2c_context[i2c_port].save_reg(dev);

      if (dev->status_reg.bus_busy)
      {
        ESP_LOGI("LGFX", "i2c::begin wait");
        auto ms = micros();
        do
        {
          taskYIELD();
        } while (dev->status_reg.bus_busy && micros() - ms < 100);
      }

      dev->int_ena.val = 0;
      dev->timeout.tout = 0xFFFFF; // max 13ms
// ---------- i2c_ll_master_init
      typeof(dev->ctr) ctrl_reg;
      ctrl_reg.val = 0;
      ctrl_reg.ms_mode = 1;       // master mode
      ctrl_reg.sda_force_out = 1;
      ctrl_reg.scl_force_out = 1;
      dev->ctr.val = ctrl_reg.val;
// ---------- i2c_ll_master_init
      typeof(dev->fifo_conf) fifo_conf_reg;
      fifo_conf_reg.val = 0;
      fifo_conf_reg.tx_fifo_rst = 1;
      fifo_conf_reg.rx_fifo_rst = 1;
      dev->fifo_conf.val = fifo_conf_reg.val;

      fifo_conf_reg.val = 0;
      dev->fifo_conf.val = fifo_conf_reg.val;

      uint32_t fifo_addr = (i2c_port == 0) ? 0x6001301c : 0x6002701c;
      i2c_set_cmd(dev, 0, I2C_CMD_RESTART, 0);
      i2c_set_cmd(dev, 2, I2C_CMD_END, 0);
      if (i2c_addr < 0x78)
      { // 7bitアドレスの場合
        i2c_set_cmd(dev, 1, I2C_CMD_WRITE, 1);
        WRITE_PERI_REG(fifo_addr, i2c_addr << 1 | (read ? I2C_MASTER_READ : I2C_MASTER_WRITE));
      }
      else
      { // 10bitアドレスの場合
        i2c_set_cmd(dev, 1, I2C_CMD_WRITE, 2);
        WRITE_PERI_REG(fifo_addr, 0xF0 | (i2c_addr>>8)<<1 | I2C_MASTER_WRITE);
        WRITE_PERI_REG(fifo_addr,         i2c_addr);
        if (read)
        { // 10bitアドレスのread要求の場合
          i2c_set_cmd(dev, 2, I2C_CMD_RESTART, 0);
          i2c_set_cmd(dev, 3, I2C_CMD_READ, 1);
          i2c_set_cmd(dev, 4, I2C_CMD_END, 0);
          WRITE_PERI_REG(fifo_addr, 0xF0 | (i2c_addr>>8)<<1 | I2C_MASTER_READ);
        }
      }

      static constexpr std::uint32_t MIN_I2C_CYCLE = 35;
      rtc_cpu_freq_config_t cpu_freq_conf;
      rtc_clk_cpu_freq_get_config(&cpu_freq_conf);
      std::uint32_t apb = 80 * 1000000;
      if (cpu_freq_conf.freq_mhz < 80)
      {
        apb = (cpu_freq_conf.source_freq_mhz * 1000000) / cpu_freq_conf.div;
      }
      std::uint32_t cycle = std::min(32767u, std::max(MIN_I2C_CYCLE, (apb / (freq + 1) + 1)));
      freq = apb / cycle;
      dev->scl_filter_cfg.en = cycle > 64;
      dev->scl_filter_cfg.thres = 0;
      dev->sda_filter_cfg.en = cycle > 64;
      dev->sda_filter_cfg.thres = 0;

/// ESP32 TRM page 286  Table 57: SCL Frequency Configuration
      std::uint32_t scl_high_offset = ( dev->scl_filter_cfg.en
                                      ? ( dev->scl_filter_cfg.thres <= 2
                                        ? 8 : (6 + dev->scl_filter_cfg.thres)
                                        )
                                      : 7
                                      );

      std::uint32_t period_total = cycle - scl_high_offset - 1;
      std::uint32_t scl_high_period = std::max(18u, (period_total-10) >> 1);
      std::uint32_t scl_low_period  = period_total - scl_high_period;

      dev->scl_high_period.period = scl_high_period;
      dev->scl_low_period .period = scl_low_period ;

