wakwak-koba/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
      dev->sda_hold.time   = std::min(1023, (dev->scl_high_period.period >> 1));
      dev->sda_sample.time = std::min(1023, (dev->scl_low_period .period >> 1));

      if (freq > 400000)
      {
        cycle = cycle * freq / 400000;
      }
      else
      if (cycle > ((1<<10)-1))
      {
        cycle = (1<<10)-1;
      }
      dev->scl_stop_hold.time = cycle << 1;     //the clock num after the STOP bit's posedge
      dev->scl_stop_setup.time = cycle;    //the clock num between the posedge of SCL and the posedge of SDA
      dev->scl_start_hold.time = cycle;    //the clock num between the negedge of SDA and negedge of SCL for start mark
      dev->scl_rstart_setup.time = cycle;  //the clock num between the posedge of SCL and the negedge of SDA for restart mark

      dev->int_clr.val = 0x1FFF;
      dev->ctr.trans_start = 1;
      i2c_context[i2c_port].state = read ? i2c_context_t::state_t::state_read : i2c_context_t::state_t::state_write;
//      i2c_context[i2c_port].connected = true;
      i2c_context[i2c_port].wait_ack = true;
    }

    cpp::result<void, error_t> endTransaction(int i2c_port)
    {
      if (i2c_port >= I2C_NUM_MAX) return cpp::fail(error_t::invalid_params);
      auto res = i2c_wait(i2c_port, true);
      auto dev = (i2c_port == 0) ? &I2C0 : &I2C1;
      if (dev->status_reg.bus_busy)
      {
        ESP_LOGI("LGFX", "i2c::end wait");
        auto ms = micros();
        do
        {
          taskYIELD();
        } while (dev->status_reg.bus_busy && micros() - ms < 100);
      }
      i2c_context[i2c_port].load_reg(dev);
      if (res.has_value())
      {
        return {};
      }
      return cpp::fail(res.error());
    }
//*/
    bool writeBytes(int i2c_port, const std::uint8_t *data, std::size_t length)
    {
      if (i2c_port >= I2C_NUM_MAX || !length) return false;
      if (i2c_context[i2c_port].state != i2c_context_t::state_write) return false;
      /*
      if (!i2c_context[i2c_port].connected) return false;
      if (i2c_context[i2c_port].mode != i2c_context_t::i2c_mode_write)
      {
        //ESP_LOGI("LGFX", "i2c write error : read mode.");
        return false;
      }
      //*/
/*
ESP_LOGI("LGFX", "W:%d", length);
char buf[128];
for (int i = 0; i < length; ++i)
{
  vsprintf(&buf[i*3], "%02x ", data[i]);
}
//*/ 
      static constexpr int txfifo_limit = 32;
      auto dev = (i2c_port == 0) ? &I2C0 : &I2C1;
      uint32_t fifo_addr = (i2c_port == 0) ? 0x6001301c : 0x6002701c;
      std::size_t len = ((length - 1) & (txfifo_limit-1)) + 1;
      do
      {
        if (!i2c_wait(i2c_port))
        {
          ESP_LOGI("LGFX", "i2c write error : ack wait");
          return false;
        }
        std::size_t idx = 0;
        do
        {
          WRITE_PERI_REG(fifo_addr, data[idx]);
        } while (++idx != len);
        i2c_set_cmd(dev, 0, I2C_CMD_WRITE, len);
        i2c_set_cmd(dev, 1, I2C_CMD_END, 0);
        dev->ctr.trans_start = 1;
        data += len;
        length -= len;
        len = txfifo_limit;
        i2c_context[i2c_port].wait_ack = true;
      } while (length);
      return true;
    }

    bool readBytes(int i2c_port, std::uint8_t *readdata, std::size_t length)
    {
      static constexpr std::uint32_t intmask = I2C_ACK_ERR_INT_RAW_M | I2C_TIME_OUT_INT_RAW_M | I2C_END_DETECT_INT_RAW_M | I2C_ARBITRATION_LOST_INT_RAW_M;
      if (i2c_port >= I2C_NUM_MAX) return false;
      if (i2c_context[i2c_port].state != i2c_context_t::state_read) return false;
      if (!length) return true;
/*
      if (i2c_context[i2c_port].mode != i2c_context_t::i2c_mode_read)
      {
        //ESP_LOGI("LGFX", "i2c read error : write mode.");
        return false;
      }
ESP_LOGI("LGFX", "R:%d", length);
*/
      auto dev = (i2c_port == 0) ? &I2C0 : &I2C1;
      std::size_t len = 0;

      std::uint32_t us_limit = (dev->scl_high_period.period + dev->scl_low_period.period + 16);
      do
      {
        len = ((length-1) & 63) + 1;
        length -= len;
        if (!i2c_wait(i2c_port))
        {
          ESP_LOGI("LGFX", "i2c read error : ack wait");
          return false;
        }
        i2c_set_cmd(dev, 0, I2C_CMD_READ, len);
        i2c_set_cmd(dev, 1, I2C_CMD_END, 0);
        dev->int_clr.val = intmask;
        dev->ctr.trans_start = 1;
        //taskYIELD();
        do
        {
          std::uint32_t us = lgfx::micros();
          while (0 == dev->status_reg.rx_fifo_cnt && !(dev->int_raw.val & intmask) && ((micros() - us) <= us_limit));
          if (0 != dev->status_reg.rx_fifo_cnt)
          {
            *readdata++ = dev->fifo_data.data;
          }
          else
          {
            i2c_stop(i2c_port);
            ESP_LOGI("LGFX", "i2c read error : read timeout");
            i2c_context[i2c_port].state = cpp::fail(error_t::communication_error);
            return false;
          }
        } while (--len);
      } while (length);

      return true;
    }

    bool writeReadBytes(int i2c_port, std::uint16_t addr, const std::uint8_t *writedata, std::uint8_t writelen, std::uint8_t *readdata, std::size_t readlen, int freq)
    {
      if (i2c_port >= I2C_NUM_MAX) return false;
      for (int retry = 5; retry >= 0; --retry)
      {
        beginTransaction(i2c_port, addr, freq, false);
        if (writeBytes(i2c_port, writedata, writelen)
        && endTransaction(i2c_port))
        {
          beginTransaction(i2c_port, addr, freq, true);
          if (readBytes(i2c_port, readdata, readlen)
          && endTransaction(i2c_port))
          {
            return true;
          }
        }
        endTransaction(i2c_port);
        ESP_LOGI("LGFX","I2C wrbytes retry");
      }
      return false;
    }

    bool readRegister(int i2c_port, std::uint16_t addr, std::uint8_t reg, std::uint8_t *data, std::size_t length, int freq)
    {
      return writeReadBytes(i2c_port, addr, &reg, 1, data, length, freq);
    }

    bool writeRegister8(int i2c_port, std::uint16_t addr, std::uint8_t reg, std::uint8_t data, std::uint8_t mask, int freq)
    {
      if (i2c_port >= I2C_NUM_MAX) return false;
      std::uint8_t tmp[2] = { reg, data };
      if (mask)
      {
        if (!writeReadBytes(i2c_port, addr, &reg, 1, &tmp[1], 1, freq)) return false;
        tmp[1] = (tmp[1] & mask) | data;
      }
      beginTransaction(i2c_port, addr, freq, false);
      bool res = writeBytes(i2c_port, tmp, 2);
      endTransaction(i2c_port);
      return res;
    }
  }

//----------------------------------------------------------------------------
 }
}

#endif
